[{"name":"Free Flag!","description":"Did you come down for the Whitehacks Conference yesterday?\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: SMU Whitehat Society","tags":[],"score":50,"score_type":"standard"},{"name":"Did you read the rules?","description":"If you have read all our rules on the discord server carefully then you can prove it with a SHA1 hash of the 10th rule (from start to end including the number). \r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nhttps:\/\/discord.gg\/yeeVr3N3hv\r\n\r\nAuthor: SMU Whitehat Society","tags":[],"score":50,"score_type":"standard"},{"name":"If you know, you know","description":"Have you checked out SMU Whitehat Society's Instagram account?\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Chloe","tags":[],"score":50,"score_type":"standard"},{"name":"Criminal","description":"In 2077, what makes someone a criminal?\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Samuel Tan","tags":[],"score":100,"score_type":"standard"},{"name":"Covid Vaccination","description":"Welcome to EIS clinic!\r\nAccess http:\/\/challenge2.whitehacks.whitehats.live:9001 to make your appointment!\r\nNote that strict measures have been implemented to adhere to company's password policy.\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Ensign","tags":[],"score":100,"score_type":"standard"},{"name":"Employee Information Heist","description":"Oliver, a new employee at your company, has implemented an Azure AD authentication system on the company website that he claims is very secure. \r\n\r\nAs the HR manager, you've accidentally forgotten to input Oliver's job title into the HR system when he onboarded and don't want to ask him directly. Can you find a way to retrieve this information using the new authentication system? \r\n\r\nRemember, Oliver thinks that no one will be able to find out anything about the company through this system, so you'll need to be clever and resourceful in order to succeed.\r\n\r\nCould you help us to find out his job title?\r\n\r\nDo not pentest the website. You only need Google and might need a programming language.\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Milton","tags":[],"score":100,"score_type":"standard"},{"name":"CyberBuzz","description":"So, you want to work at the Arasaka Corporation. Just simply pass this standard coding interview question!\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Samuel Tan","tags":[],"score":100,"score_type":"standard"},{"name":"Cyber Punks","description":"Welcome to the Cyber Punks NFT generation service. All our patented Punks™ are guaranteed to be 100% unique and never seen before! You can tell based on the completely random ID attached to your new shiny NFT. Come try it out!\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Samuel Tan","tags":[],"score":100,"score_type":"standard"},{"name":"Who's my favourite pokemon?","description":"Hmm... I wonder if you can figure out who my favourite pokemon is and get the flag\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Zara Teo","tags":[],"score":100,"score_type":"standard","file":["whos_my_favourite_pokemon.txt"]},{"name":"I can't find my friend!","description":"\"My friend told me that he is “here”. Where is here?\r\n\r\nNote: Flag should be in the following format:  MRTcode_MRTname\r\n\r\nExample 1: If the location identified is Bukit Batok, your flag should be WH2023{NS2_Bukit_Batok}\r\n\r\nExample 2: If the location identified is Queenstown, your flag should be WH2023{EW19_Queenstown}\"\r\n\t\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Zara Teo","tags":[],"score":100,"score_type":"standard","file":["i_cant_find_my_friend.jpg"]},{"name":"Hidden Treasure","description":"You have received an encrypted email containing your invitation to Whitehacks 2023. \r\n\r\nHowever, your email was hijacked by some cyber punks, who tried to uncover the hidden flag within your invitation but failed, so they disfigured your invitation instead!\r\n\r\nCan you retrieve the flag within?\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: xbowery","tags":[],"score":100,"score_type":"standard","file":["Hidden_Treasure.pdf"]},{"name":"Zip? Unzip?","description":"I was given this zip file. I know I'm supposed to find a flag, but where is it?\r\n\r\nHint: look out for hints!\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Zara Teo","tags":[],"score":100,"score_type":"standard","file":["ZipUnZip.zip"]},{"name":"Cyber Shef","description":"My chef is missing but he left this message at the kitchen. I think its the recipe for my dinner, could you help me to figure out what's in it?\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Jingkai","tags":[],"score":100,"score_type":"standard","file":["message.txt"]},{"name":"Block Ciphering","description":"In symmetric encryption block ciphering, there are three modes of encryption:\r\n\r\n* ECB: Electronic Code Book\r\n* CBC: Cipher Block Chaining\r\n* CTR: Counter\r\n\r\nWe will be using the Cipher Block Chaining.\r\n\r\nMapping of before and after is included in the attachment.\r\n\r\nGive a plaintext binary return the encrypted binary using CBC mode.\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Jingkai","tags":[],"score":100,"score_type":"standard","file":["blockciphering.png"]},{"name":"Too Slow","description":"I've made a binary that prints the flag for you! \r\n\r\nToo bad you'll only get it after the CTF ends.\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Jared","tags":[],"score":100,"score_type":"standard","file":["TooSlow.exe"]},{"name":"BeepBeepBoopBoop","description":"I keep hearing this sound, but I can't figure out what it is. Can you help me?\r\n\r\nThe flag should be in all uppercase.\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Zara Teo","tags":[],"score":100,"score_type":"standard","file":["BeepBeepBoopBoop.m4a","beepbeepboopboop.jpg"]},{"name":"Spy x Whitehats","description":"I was snooping on a discussion about Whitehacks. I think they were even discussing a flag!\r\n\r\nCan you help me find it?\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Chloe","tags":[],"score":100,"score_type":"standard","file":["spy_x_whitehats.pcapng"]},{"name":"DinnerEatWhat","description":"My chef wanted to cook dinner but he is nowhere to be found. I remember him telling me about Playfair cipher yesterday while we were playing dota. I also remember him telling me that he always uses playsmart as the cipher key to communicate with his wife.\r\n\r\nMaybe you could help me to find where did he put the recipe and whats for dinner?\r\n\r\npassword: whitehacks\r\n\r\nThe flag will be in the format WH2023{flag}.\r\n\r\nAuthor: Zheng Da","tags":[],"score":100,"score_type":"standard"},{"name":"GrindPunk","description":"You need to help V find the most reward within the allocated time to get all the upgrades he needs before his fight with Adam Smasher.\r\n\r\nYou will be given the maximum time and a list of tuples containing 2 integers, the first being the Eddies awarded for completing the mission, and the second being the amount of time required to complete it.\r\n\r\nInput the most number of Eddies that V can accumulate before the time runs out.\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Ryan Loh (mrchoc)","tags":[],"score":100,"score_type":"standard"},{"name":"Wardialer","description":"It appears that V has managed to get hold of a high ranking Arasaka Corporation employee's cell phone. Additionally, he has stolen a state-of-the-art computer program specially built for Corpo espionage straight out of Arasaka's Security division. With a phone number, this program is able to dial it and exfiltrate a list of contacts on that phone. With a single employee's phone, you can exfiltrate their boss's phone number, and from their boss, their boss's boss's phone number, and so on.\r\n\r\nIt is urgent that V finds out the phone number of Saburo Arasaka, the head of the Arasaka Corporation. To do so, you will have to climb the network from employee to employee, all the way to the top. Can you help V?\r\n\r\nThe number of the cell phone V retrieved: `133713879102`\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Samuel Tan","tags":[],"score":200,"score_type":"dynamic"},{"name":"Poker","description":"Let's play Poker! I'll give you an advantage by letting you draw the first five cards first.\r\n\r\nWith that, can you figure out the rest of the deck?\r\n\r\nAccess the server: nc host port\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Milton","tags":[],"score":200,"score_type":"dynamic","file":["app.py"]},{"name":"Calculator App","description":"Look at my calculator application! It does math well.\r\nBut does it also allow other commands to be run?\r\nHow do I get past the filters?\r\nMaybe I need to chain them up.\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Ensign","tags":[],"score":200,"score_type":"dynamic"},{"name":"Final Message","description":"Johnny Silverhand, the man himself, has sent you 2 messages, but the second one seems to be messed up... \r\n\r\nThis is of vital importance. We have not heard back from him since then. \r\n\r\nWe need to know what his final message was.\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Samuel Tan","tags":[],"score":236,"score_type":"dynamic","file":["message_1.png","message_2.png"]},{"name":"The Forgotten Keys","description":"You've found a set of keys under the carpet of your friend's house on Christmas day. A note accompanied the keys, reading: \"\"Seek, and you shall find. The access key is incomplete. Only I remember the last three characters.\"\" It seems that only the access key is incomplete, while the secret key is complete. Can you figure out what these keys unlock, and what you can do with them?\r\n\r\nNote: Only the access key is incomplete. The secret key is complete.\r\n\r\nAccess Key: AKIAURMRS6OY3TSIS\r\nSecret Key: t2gYzB4M6tF9cvV0vbs1oyO3owE9gYwXtk4UtOo2\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Milton","tags":[],"score":300,"score_type":"dynamic"},{"name":"mem kopi","description":"I wonder what this memkopi will do...\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Lucas","tags":[],"score":300,"score_type":"dynamic","file":["dist.zip","libc-2.31.so"]},{"name":"Dumpling Cookbook","description":"Dumpling Cookbook! I can take your dumpling order in this website! Then I'll send you your cooked dumpling in 3-5 business days. In the mean time you can take a look at the sample dumpling pictures I created for you. Let me know if you like the way it looks. \r\n\r\nNote: Not responsible for any food poisoning that may or may not happen.\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Ensign\r\n\r\nAlternative Connection: http:\/\/challenge2.whitehacks.whitehats.live:5002","tags":[],"score":300,"score_type":"dynamic"},{"name":"Serial Forger","description":"This encrypton service provides a new method of text input by pulling data from a website! How cool!\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: GovTech","tags":[],"score":300,"score_type":"dynamic"},{"name":"WhiteHacked","description":"John accesses his company work portal through some application, however something seems different when he accessed it today. We suspect a hacker has overridden his settings. Help us find the original address that John was supposed to go to, as well as the address that the hacker is using.\r\n\r\nFlag format: WH2023{'original address','hacker address'}\r\n\r\nAuthor: Samuel","tags":[],"score":300,"score_type":"dynamic","file":["mem.7z"]},{"name":"D-Cereal App","description":"D-Cereal is the best cereal around! Here is my little D-Cereal website that uses a neat trick to remember your name! Try it out! I even provided the source code so that you can take a look at how it works!\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Ensign","tags":[],"score":400,"score_type":"dynamic","file":["api.php"]},{"name":"Trauma Team","description":"Welcome to the Trauma Team. As part of our platinum package, we pride ourselves in being able to reach our patients in under 10 seconds, no matter how far away they are. Can you help us with this guarantee?\r\n\r\nNOTE 1: The given map is represented as a 2D array of characters.\r\n0 - Empty (You can move onto these cells)\r\nX - Wall (You can NOT move onto these cells)\r\nT - Trauma Team (You)\r\nP - Patient (Target)\r\n\r\nNOTE 2: This challenge expects the shortest sequence of moves as an answer. Please submit your answer as a sequence of moves represented by 1 character per move as shown below.\r\nU - Up\r\nD - Down\r\nL - Left\r\nR - Right\r\nSample Answer: `UURRD`\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Samuel Tan","tags":[],"score":400,"score_type":"dynamic"},{"name":"Piggy Bank 3.0","description":"We're back with a new and updated Piggy Bank from Whitehacks 2021. This time, I'm literally using haskell, which chatGPT tells me is a \"memory safe\" language. So anyways, that means I'm super secure right...\r\n\r\nHint: the challenge was compiled on Ubuntu 18.04\r\n\r\nThe flag will be in this format: WH2023{flag}\r\n\r\nAuthor: Sean","tags":[],"score":484,"score_type":"dynamic","file":["distrib.zip"]}]